from random import *
import random

# #1 -------------------------------------------------------------------------------------------------------------------

# list1 = []

# print("Чтоб остановить введите не число")

# while True:
#     try:
#         v = float(input("Введите число: "))
#         list1.append(v)
#     except:
#         break
        
# v_max = max(list1)
# print(f"Максимальное из ведённых вами чисел: {v_max}")


# #2 -------------------------------------------------------------------------------------------------------------------

# print("Чтоб остановить введите не число")

# while True:
#     try:    
#         v = int(input("Введите целое число: "))
#         if v == 13:
#             print(77)
#         else:
#             print(v)
#     except:
#         pass


# # 3 -------------------------------------------------------------------------------------------------------------------

# list1 = [10]

# for x in range(7):
#     list1.append(list1[x] + list1[x] / 100 * 10)

# v = sum(list1)
# print(f"Спортсмен пробежал за 7 дней: {v} км")


# # 4 -------------------------------------------------------------------------------------------------------------------

# cost_metr = 1
# lenth = round(random.uniform(20, 1000), 2)
# print (f"В наличии {lenth} метров ткани")
# print (f"Цена {cost_metr} евро за метр ткани")


# while True:
#     print (f"В наличии {round(lenth, 2)} метров ткани")
#     how = float(input("Сколько хотите купить в метрах(x.xx): "))
#     if lenth > how or lenth == how:
#         lenth -= how
#         print(f"C вас к оплате {how * cost_metr} евро")
#         wan = int(input(f"Хотите купить ещё? 1 - Да: "))
#         if wan == 1:
#             continue
#         else:
#             break
#     else:
#         wan = int(input(f"Извините, у нас не хватает ткани, хотите выкупить остаток {lenth}? 1 - Да: "))
#         if wan == 1:
#             continue
#         else:
#             break


# # 5 -------------------------------------------------------------------------------------------------------------------

# while True:
#     wan = input("Хотите посчитать площадь трапеции?1 - Да: ")
#     if wan == 1:
#         a = float(input("Введите длинну основание трапеции"))
#         b = float(input("Введите длинну основание трапеции"))
#         h = float(input("Введите высоту трапеции"))
        
#         s = (a + b) * h / 2
        
#         print(f"Площадь трепеции с введёными вами данными равна {s}")
#         continue
#     else:
#         break


# # 6 -------------------------------------------------------------------------------------------------------------------

print("Введите число и мы проверим делится ли оно на 3 без остатка")
while True:
    while True:
        try:
            int1 = int(input("Введите целое число: "))
            break
        except:
            print("Вы ввели неверное значение")
    if int1//3 == 0:
        print("Ваше число делится на 3")
    else:
        print("Ваше число не делится на 3")
    wan = input("Продолжим? 1 - Да: ")
    if wan == 1:
        pass
    else:
        break
    
